blog/index.org
#+TITLE: CtrlAltDelete.nu
#+DESCRIPTION: It's all about 42, (defn foobarbaz []) and cheeseburgers.
#+AUTHOR: Anton Erholt
#+STARTUP: indent hidestars
#+STARTUP: logdone
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LANGUAGE:  en
#+HUGO_SECTION: blog
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_WEIGHT: auto

** DONE The game producer - Game business models        :game:design:
:PROPERTIES:
:EXPORT_FILE_NAME: game-producer-business-models
:EXPORT_DATE: 2013-12-03
:END:
# Present up to three (3) game-related business models and highlight the
# pros and cons with each. Remember to exemplify and reference!

Now I'll briefly discuss some business models. Please note that I'm
probably a bit biased.

*** Pay-to-play (P2P)
The "standard" model. You pay for a game once and then it is
yours. For all eternity... Oh, you want an example? Hmm... Let's
see. Oh! Project Zomboid [fn:25] mentioned in an earlier post is a good example.

- *Pros*
  - You don't have to keep track of all the players

- *Cons*
  - The eventual income will spike and then drastically fall.
  - Typically means there will be sequels if the devs are successful.

*** Subscription
Well, the most obvious example I can come up with is World of
Warcraft [fn:24], where you pay a fee each month to continue playing.

- *Pros*
  - Continuous cashflow means an ability to have continuous development
  - Makes scalability easier

- *Cons*
  - Player database needed to keep track of payments etc.

- *Comments*
  - I think this model is perfectly suited for the MMO type of games
    which take a lot of time and effort to maintain and develop. You
    already do have a player database with accounts, so this should
    not be that much of a problem.

*** Free-to-play (F2P)
A great example is the giant in the MOBA-genre [fn:26], DotA 2. In
this game you can buy skins and new visual styles for the characters
in the game.

- *Pros*
   - Players get to play, haters get to hate and lovers get to
     love. You don't have to feel bad for trying to trick money out of
     someone...

- *Cons*
  - ... or yes you do. But how!? This business model requires
    something else to generate income, such as ads or in-game
    purchases.

A thing to keep in mind is that it is not completely impossible to
switch business model, even though it might hurt some of your
playerbase.  One example of where a switching between business models
has been successful is Heroes of Newerth [fn:12]. The game is F2P
since the 20th of July 2012 [fn:13] (is used to be P2P).

