content/blog/game-producer-business-models.md
+++
title = "The game producer - Game business models"
author = ["Anton Erholt"]
description = "It's all about 42, (defn foobarbaz []) and cheeseburgers."
date = 2013-12-03
lastmod = 2018-10-07T11:23:51+02:00
tags = ["game", "design"]
categories = ["blog"]
draft = false
weight = 2018
+++

Now I'll briefly discuss some business models. Please note that I'm
probably a bit biased.


## Pay-to-play (P2P) {#pay-to-play--p2p}

The "standard" model. You pay for a game once and then it is
yours. For all eternity&#x2026; Oh, you want an example? Hmm&#x2026; Let's
see. Oh! Project Zomboid&nbsp;[^fn:1] mentioned in an earlier post is a good example.

-   **Pros**
    -   You don't have to keep track of all the players

-   **Cons**
    -   The eventual income will spike and then drastically fall.
    -   Typically means there will be sequels if the devs are successful.


## Subscription {#subscription}

Well, the most obvious example I can come up with is World of
Warcraft&nbsp;[^fn:2], where you pay a fee each month to continue playing.

-   **Pros**
    -   Continuous cashflow means an ability to have continuous development
    -   Makes scalability easier

-   **Cons**
    -   Player database needed to keep track of payments etc.

-   **Comments**
    -   I think this model is perfectly suited for the MMO type of games
        which take a lot of time and effort to maintain and develop. You
        already do have a player database with accounts, so this should
        not be that much of a problem.


## Free-to-play (F2P) {#free-to-play--f2p}

A great example is the giant in the MOBA-genre&nbsp;[^fn:3], DotA 2. In
this game you can buy skins and new visual styles for the characters
in the game.

-   **Pros**
    -   Players get to play, haters get to hate and lovers get to
        love. You don't have to feel bad for trying to trick money out of
        someone&#x2026;

-   **Cons**
    -   &#x2026; or yes you do. But how!? This business model requires
        something else to generate income, such as ads or in-game
        purchases.

A thing to keep in mind is that it is not completely impossible to
switch business model, even though it might hurt some of your
playerbase.  One example of where a switching between business models
has been successful is Heroes of Newerth&nbsp;[^fn:4]. The game is F2P
since the 20th of July 2012&nbsp;[^fn:5] (is used to be P2P).

[^fn:1]: <http://pzwiki.net/wiki/Main%5FPage>
[^fn:2]: <http://eu.battle.net/wow/en/game/guide/>
[^fn:3]: <http://en.wikipedia.org/wiki/Multiplayer%5Fonline%5Fbattle%5Farena>
[^fn:4]: <http://www.rockpapershotgun.com/2012/07/20/dota-lol-all-heroes-of-newerth-heroes-going-free/>
[^fn:5]: <http://forums.heroesofnewerth.com/showthread.php?436758-Attention-Neweth!-All-Heroes-Going-Free>!
